tutorials/multiRegion/film/cylinderVoF/system/film/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/film";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phid,alpha)     Gauss upwind;
    div(alphaRhoPhi,U)  Gauss upwind;
    div(alphaRhoPhi,e)  Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
